{
  "id": "00000000-0000-0000-0000-000000000000",
  "kind": "NotebookInstance",
  "apiVersion": "sagemaker.services.k8s.aws/v1alpha1",
  "displayName": "Notebook Instance",
  "format": "JSON",
  "hostID": "00000000-0000-0000-0000-000000000000",
  "metadata": {
   "isNamespaced": true
  },
  "model": {
   "id": "00000000-0000-0000-0000-000000000000",
   "name": "aws-sagemaker-controller",
   "version": "v1.2.7",
   "displayName": "aws-sagemaker-controller",
   "hostID": "00000000-0000-0000-0000-000000000000",
   "category": {
    "name": "",
    "metadata": null
   },
   "metadata": {
    "source_uri": "git://github.com/aws-controllers-k8s/sagemaker-controller/main/helm"
   },
   "components": null,
   "relationships": null
  },
  "schema": "{\n \"description\": \"NotebookInstance is the Schema for the NotebookInstances API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"NotebookInstanceSpec defines the desired state of NotebookInstance.\",\n   \"properties\": {\n    \"acceleratorTypes\": {\n     \"description\": \"A list of Elastic Inference (EI) instance types to associate with this notebook\\ninstance. Currently, only one instance type can be associated with a notebook\\ninstance. For more information, see Using Elastic Inference in Amazon SageMaker\\n(https://docs.aws.amazon.com/sagemaker/latest/dg/ei.html).\",\n     \"items\": {\n      \"type\": \"string\"\n     },\n     \"type\": \"array\"\n    },\n    \"additionalCodeRepositories\": {\n     \"description\": \"An array of up to three Git repositories to associate with the notebook instance.\\nThese can be either the names of Git repositories stored as resources in\\nyour account, or the URL of Git repositories in Amazon Web Services CodeCommit\\n(https://docs.aws.amazon.com/codecommit/latest/userguide/welcome.html) or\\nin any other Git repository. These repositories are cloned at the same level\\nas the default repository of your notebook instance. For more information,\\nsee Associating Git Repositories with SageMaker Notebook Instances (https://docs.aws.amazon.com/sagemaker/latest/dg/nbi-git-repo.html).\",\n     \"items\": {\n      \"type\": \"string\"\n     },\n     \"type\": \"array\"\n    },\n    \"defaultCodeRepository\": {\n     \"description\": \"A Git repository to associate with the notebook instance as its default code\\nrepository. This can be either the name of a Git repository stored as a resource\\nin your account, or the URL of a Git repository in Amazon Web Services CodeCommit\\n(https://docs.aws.amazon.com/codecommit/latest/userguide/welcome.html) or\\nin any other Git repository. When you open a notebook instance, it opens\\nin the directory that contains this repository. For more information, see\\nAssociating Git Repositories with SageMaker Notebook Instances (https://docs.aws.amazon.com/sagemaker/latest/dg/nbi-git-repo.html).\",\n     \"type\": \"string\"\n    },\n    \"directInternetAccess\": {\n     \"description\": \"Sets whether SageMaker provides internet access to the notebook instance.\\nIf you set this to Disabled this notebook instance is able to access resources\\nonly in your VPC, and is not be able to connect to SageMaker training and\\nendpoint services unless you configure a NAT Gateway in your VPC.\\n\\n\\nFor more information, see Notebook Instances Are Internet-Enabled by Default\\n(https://docs.aws.amazon.com/sagemaker/latest/dg/appendix-additional-considerations.html#appendix-notebook-and-internet-access).\\nYou can set the value of this parameter to Disabled only if you set a value\\nfor the SubnetId parameter.\",\n     \"type\": \"string\"\n    },\n    \"instanceType\": {\n     \"description\": \"The type of ML compute instance to launch for the notebook instance.\",\n     \"type\": \"string\"\n    },\n    \"kmsKeyID\": {\n     \"description\": \"The Amazon Resource Name (ARN) of a Amazon Web Services Key Management Service\\nkey that SageMaker uses to encrypt data on the storage volume attached to\\nyour notebook instance. The KMS key you provide must be enabled. For information,\\nsee Enabling and Disabling Keys (https://docs.aws.amazon.com/kms/latest/developerguide/enabling-keys.html)\\nin the Amazon Web Services Key Management Service Developer Guide.\",\n     \"type\": \"string\"\n    },\n    \"lifecycleConfigName\": {\n     \"description\": \"The name of a lifecycle configuration to associate with the notebook instance.\\nFor information about lifestyle configurations, see Step 2.1: (Optional)\\nCustomize a Notebook Instance (https://docs.aws.amazon.com/sagemaker/latest/dg/notebook-lifecycle-config.html).\",\n     \"type\": \"string\"\n    },\n    \"notebookInstanceName\": {\n     \"description\": \"The name of the new notebook instance.\",\n     \"type\": \"string\"\n    },\n    \"platformIdentifier\": {\n     \"description\": \"The platform identifier of the notebook instance runtime environment.\",\n     \"type\": \"string\"\n    },\n    \"roleARN\": {\n     \"description\": \"When you send any requests to Amazon Web Services resources from the notebook\\ninstance, SageMaker assumes this role to perform tasks on your behalf. You\\nmust grant this role necessary permissions so SageMaker can perform these\\ntasks. The policy must allow the SageMaker service principal (sagemaker.amazonaws.com)\\npermissions to assume this role. For more information, see SageMaker Roles\\n(https://docs.aws.amazon.com/sagemaker/latest/dg/sagemaker-roles.html).\\n\\n\\nTo be able to pass this role to SageMaker, the caller of this API must have\\nthe iam:PassRole permission.\",\n     \"type\": \"string\"\n    },\n    \"rootAccess\": {\n     \"description\": \"Whether root access is enabled or disabled for users of the notebook instance.\\nThe default value is Enabled.\\n\\n\\nLifecycle configurations need root access to be able to set up a notebook\\ninstance. Because of this, lifecycle configurations associated with a notebook\\ninstance always run with root access even if you disable root access for\\nusers.\",\n     \"type\": \"string\"\n    },\n    \"securityGroupIDs\": {\n     \"description\": \"The VPC security group IDs, in the form sg-xxxxxxxx. The security groups\\nmust be for the same VPC as specified in the subnet.\",\n     \"items\": {\n      \"type\": \"string\"\n     },\n     \"type\": \"array\"\n    },\n    \"subnetID\": {\n     \"description\": \"The ID of the subnet in a VPC to which you would like to have a connectivity\\nfrom your ML compute instance.\",\n     \"type\": \"string\"\n    },\n    \"tags\": {\n     \"description\": \"An array of key-value pairs. You can use tags to categorize your Amazon Web\\nServices resources in different ways, for example, by purpose, owner, or\\nenvironment. For more information, see Tagging Amazon Web Services Resources\\n(https://docs.aws.amazon.com/general/latest/gr/aws_tagging.html).\",\n     \"items\": {\n      \"description\": \"A tag object that consists of a key and an optional value, used to manage\\nmetadata for SageMaker Amazon Web Services resources.\\n\\n\\nYou can add tags to notebook instances, training jobs, hyperparameter tuning\\njobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations,\\nand endpoints. For more information on adding tags to SageMaker resources,\\nsee AddTags.\\n\\n\\nFor more information on adding metadata to your Amazon Web Services resources\\nwith tagging, see Tagging Amazon Web Services resources (https://docs.aws.amazon.com/general/latest/gr/aws_tagging.html).\\nFor advice on best practices for managing Amazon Web Services resources with\\ntagging, see Tagging Best Practices: Implement an Effective Amazon Web Services\\nResource Tagging Strategy (https://d1.awsstatic.com/whitepapers/aws-tagging-best-practices.pdf).\",\n      \"properties\": {\n       \"key\": {\n        \"type\": \"string\"\n       },\n       \"value\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    },\n    \"volumeSizeInGB\": {\n     \"description\": \"The size, in GB, of the ML storage volume to attach to the notebook instance.\\nThe default value is 5 GB.\",\n     \"format\": \"int64\",\n     \"type\": \"integer\"\n    }\n   },\n   \"required\": [\n    \"instanceType\",\n    \"notebookInstanceName\",\n    \"roleARN\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Notebook Instance\",\n \"type\": \"object\"\n}"
 }