{
  "id": "00000000-0000-0000-0000-000000000000",
  "kind": "SGBackup",
  "apiVersion": "stackgres.io/v1",
  "displayName": "SG Backup",
  "format": "JSON",
  "hostID": "00000000-0000-0000-0000-000000000000",
  "metadata": {
   "isNamespaced": true
  },
  "model": {
   "id": "00000000-0000-0000-0000-000000000000",
   "name": "stackgres-operator",
   "version": "1.8.0",
   "displayName": "stackgres-operator",
   "status": "",
   "hostID": "00000000-0000-0000-0000-000000000000",
   "category": {
    "name": "",
    "metadata": null
   },
   "metadata": {
    "source_uri": "https://stackgres.io/downloads/stackgres-k8s/stackgres/1.8.0/helm/stackgres-operator.tgz"
   },
   "components": null,
   "relationships": null
  },
  "schema": "{\n \"description\": \"A manual or automatically generated backup of an SGCluster configured with backups.\\n\\nWhen a SGBackup is created a Job will perform a full backup of the database and update the status of the SGBackup\\n with the all the information required to restore it and some stats (or a failure message in case something unexpected\\n happened).\\nBackup generated by SGBackup are stored in an SGObjectStorage together with the WAL files or in a VolumeSnapshot (separated\\n from the WAL files) depending on the backup configuration of the targeted SGCluster.\\nAfter an SGBackup is created the same Job performs a reconciliation of the backups by applying the retention window\\n that has been configured in the SGCluster and removing the backups with managed lifecycle and the WAL files older\\n than the ones that fit in the retention window. The reconciliation also removes backups (excluding WAL files) that do\\n not belongs to any SGBackup (including copies). If the target storage is changed deletion of an SGBackup backups with\\n managed lifecycle and the WAL files older than the ones that fit in the retention window and of backups that do not\\n belongs to any SGBackup will not be performed anymore on the previous storage, only on the new target storage.\\nIf the reconciliation of backups fails the backup itself do not fail and will be re-tried the next time a SGBackup\\n or shecduled backup Job take place.\\n\",\n \"properties\": {\n  \"spec\": {\n   \"properties\": {\n    \"managedLifecycle\": {\n     \"description\": \"Indicate if this backup is not permanent and should be removed by the automated\\n retention policy. Default is `false`.\\n\",\n     \"type\": \"boolean\"\n    },\n    \"reconciliationTimeout\": {\n     \"default\": 300,\n     \"description\": \"Allow to set a timeout for the reconciliation process that take place after the backup.\\n\\nIf not set defaults to 300 (5 minutes). If set to 0 it will disable timeout.\\n\\nFailure of reconciliation will not make the backup fail and will be re-tried the next time a SGBackup\\n or shecduled backup Job take place.\\n\",\n     \"type\": \"integer\"\n    },\n    \"sgCluster\": {\n     \"description\": \"The name of the `SGCluster` from which this backup is/will be taken.\\n\\nIf this is a copy of an existing completed backup in a different namespace\\n the value must be prefixed with the namespace of the source backup and a\\n dot `.` (e.g. `\\u003ccluster namespace\\u003e.\\u003ccluster name\\u003e`) or have the same value\\n if the source backup is also a copy.\\n\",\n     \"type\": \"string\"\n    },\n    \"timeout\": {\n     \"description\": \"Allow to set a timeout for the backup creation.\\n\\nIf not set it will be disabled and the backup operation will continue until the backup completes or fail. If set to 0 is the same as not being set.\\n\\nMake sure to set a reasonable high value in order to allow for any unexpected delays during backup creation (network low bandwidth, disk low throughput and so forth).\\n\",\n     \"type\": \"integer\"\n    }\n   },\n   \"type\": \"object\"\n  }\n },\n \"required\": [\n  \"metadata\",\n  \"spec\"\n ],\n \"title\": \"SG Backup\",\n \"type\": \"object\"\n}"
 }