{"kind":"FeatureGroup","apiVersion":"sagemaker.services.k8s.aws/v1alpha1","displayName":"Feature Group","format":"JSON","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","metadata":{"isNamespaced":true},"model":{"name":"aws-sagemaker-controller","version":"1.2.4","displayName":"aws-sagemaker-controller","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","category":{"name":"","metadata":null},"metadata":{},"components":null,"relationships":null},"schema":"{\n \"description\": \"FeatureGroup is the Schema for the FeatureGroups API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"FeatureGroupSpec defines the desired state of FeatureGroup. \\n Amazon SageMaker Feature Store stores features in a collection called Feature Group. A Feature Group can be visualized as a table which has rows, with a unique identifier for each row where each column in the table is a feature. In principle, a Feature Group is composed of features and values per features.\",\n   \"properties\": {\n    \"description\": {\n     \"description\": \"A free-form description of a FeatureGroup.\",\n     \"type\": \"string\"\n    },\n    \"eventTimeFeatureName\": {\n     \"description\": \"The name of the feature that stores the EventTime of a Record in a FeatureGroup. \\n An EventTime is a point in time when a new event occurs that corresponds to the creation or update of a Record in a FeatureGroup. All Records in the FeatureGroup must have a corresponding EventTime. \\n An EventTime can be a String or Fractional. \\n - Fractional: EventTime feature values must be a Unix timestamp in seconds. \\n - String: EventTime feature values must be an ISO-8601 string in the format. The following formats are supported yyyy-MM-dd'T'HH:mm:ssZ and yyyy-MM-dd'T'HH:mm:ss.SSSZ where yyyy, MM, and dd represent the year, month, and day respectively and HH, mm, ss, and if applicable, SSS represent the hour, month, second and milliseconds respsectively. 'T' and Z are constants.\",\n     \"type\": \"string\"\n    },\n    \"featureDefinitions\": {\n     \"description\": \"A list of Feature names and types. Name and Type is compulsory per Feature. \\n Valid feature FeatureTypes are Integral, Fractional and String. \\n FeatureNames cannot be any of the following: is_deleted, write_time, api_invocation_time \\n You can create up to 2,500 FeatureDefinitions per FeatureGroup.\",\n     \"items\": {\n      \"description\": \"A list of features. You must include FeatureName and FeatureType. Valid feature FeatureTypes are Integral, Fractional and String.\",\n      \"properties\": {\n       \"featureName\": {\n        \"type\": \"string\"\n       },\n       \"featureType\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    },\n    \"featureGroupName\": {\n     \"description\": \"The name of the FeatureGroup. The name must be unique within an Amazon Web Services Region in an Amazon Web Services account. The name: \\n - Must start and end with an alphanumeric character. \\n - Can only contain alphanumeric character and hyphens. Spaces are not allowed.\",\n     \"type\": \"string\"\n    },\n    \"offlineStoreConfig\": {\n     \"description\": \"Use this to configure an OfflineFeatureStore. This parameter allows you to specify: \\n - The Amazon Simple Storage Service (Amazon S3) location of an OfflineStore. \\n - A configuration for an Amazon Web Services Glue or Amazon Web Services Hive data catalog. \\n - An KMS encryption key to encrypt the Amazon S3 location used for OfflineStore. If KMS encryption key is not specified, by default we encrypt all data at rest using Amazon Web Services KMS key. By defining your bucket-level key (https://docs.aws.amazon.com/AmazonS3/latest/userguide/bucket-key.html) for SSE, you can reduce Amazon Web Services KMS requests costs by up to 99 percent. \\n - Format for the offline store table. Supported formats are Glue (Default) and Apache Iceberg (https://iceberg.apache.org/). \\n To learn more about this parameter, see OfflineStoreConfig.\",\n     \"properties\": {\n      \"dataCatalogConfig\": {\n       \"description\": \"The meta data of the Glue table which serves as data catalog for the OfflineStore.\",\n       \"properties\": {\n        \"catalog\": {\n         \"type\": \"string\"\n        },\n        \"database\": {\n         \"type\": \"string\"\n        },\n        \"tableName\": {\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      },\n      \"disableGlueTableCreation\": {\n       \"type\": \"boolean\"\n      },\n      \"s3StorageConfig\": {\n       \"description\": \"The Amazon Simple Storage (Amazon S3) location and and security configuration for OfflineStore.\",\n       \"properties\": {\n        \"kmsKeyID\": {\n         \"type\": \"string\"\n        },\n        \"resolvedOutputS3URI\": {\n         \"type\": \"string\"\n        },\n        \"s3URI\": {\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"onlineStoreConfig\": {\n     \"description\": \"You can turn the OnlineStore on or off by specifying True for the EnableOnlineStore flag in OnlineStoreConfig; the default value is False. \\n You can also include an Amazon Web Services KMS key ID (KMSKeyId) for at-rest encryption of the OnlineStore.\",\n     \"properties\": {\n      \"enableOnlineStore\": {\n       \"type\": \"boolean\"\n      },\n      \"securityConfig\": {\n       \"description\": \"The security configuration for OnlineStore.\",\n       \"properties\": {\n        \"kmsKeyID\": {\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"recordIdentifierFeatureName\": {\n     \"description\": \"The name of the Feature whose value uniquely identifies a Record defined in the FeatureStore. Only the latest record per identifier value will be stored in the OnlineStore. RecordIdentifierFeatureName must be one of feature definitions' names. \\n You use the RecordIdentifierFeatureName to access data in a FeatureStore. \\n This name: \\n - Must start and end with an alphanumeric character. \\n - Can only contains alphanumeric characters, hyphens, underscores. Spaces are not allowed.\",\n     \"type\": \"string\"\n    },\n    \"roleARN\": {\n     \"description\": \"The Amazon Resource Name (ARN) of the IAM execution role used to persist data into the OfflineStore if an OfflineStoreConfig is provided.\",\n     \"type\": \"string\"\n    },\n    \"tags\": {\n     \"description\": \"Tags used to identify Features in each FeatureGroup.\",\n     \"items\": {\n      \"description\": \"A tag object that consists of a key and an optional value, used to manage metadata for SageMaker Amazon Web Services resources. \\n You can add tags to notebook instances, training jobs, hyperparameter tuning jobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations, and endpoints. For more information on adding tags to SageMaker resources, see AddTags. \\n For more information on adding metadata to your Amazon Web Services resources with tagging, see Tagging Amazon Web Services resources (https://docs.aws.amazon.com/general/latest/gr/aws_tagging.html). For advice on best practices for managing Amazon Web Services resources with tagging, see Tagging Best Practices: Implement an Effective Amazon Web Services Resource Tagging Strategy (https://d1.awsstatic.com/whitepapers/aws-tagging-best-practices.pdf).\",\n      \"properties\": {\n       \"key\": {\n        \"type\": \"string\"\n       },\n       \"value\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    }\n   },\n   \"required\": [\n    \"eventTimeFeatureName\",\n    \"featureDefinitions\",\n    \"featureGroupName\",\n    \"recordIdentifierFeatureName\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Feature Group\",\n \"type\": \"object\"\n}"}