{"kind":"ReplicaSchedulingPreference","apiVersion":"scheduling.kubefed.io/v1alpha1","displayName":"Replica Scheduling Preference","format":"JSON","metadata":{"genealogy":"","isNamespaced":true,"logoURL":"","model":"kubefed","modelDisplayName":"Kubefed","primaryColor":"#00B39F","published":false,"secondaryColor":"#00D3A9","shape":"circle","styleOverrides":"","subCategory":"Uncategorized","svgColor":"","svgComplete":"","svgWhite":""},"model":{"name":"kubefed","version":"0.10.0","displayName":"Kubefed","category":{"name":"Uncategorized","metadata":null},"metadata":{"source_uri":"https://github.com/kubernetes-sigs/kubefed/releases/download/v0.10.0/kubefed-0.10.0.tgz"}},"schema":"{\n \"properties\": {\n  \"spec\": {\n   \"description\": \"ReplicaSchedulingPreferenceSpec defines the desired state of ReplicaSchedulingPreference\",\n   \"properties\": {\n    \"clusters\": {\n     \"additionalProperties\": {\n      \"description\": \"Preferences regarding number of replicas assigned to a cluster workload object (dep, rs, ..) within a federated workload object.\",\n      \"properties\": {\n       \"maxReplicas\": {\n        \"description\": \"Maximum number of replicas that should be assigned to this cluster workload object. Unbounded if no value provided (default).\",\n        \"format\": \"int64\",\n        \"type\": \"integer\"\n       },\n       \"minReplicas\": {\n        \"description\": \"Minimum number of replicas that should be assigned to this cluster workload object. 0 by default.\",\n        \"format\": \"int64\",\n        \"type\": \"integer\"\n       },\n       \"weight\": {\n        \"description\": \"A number expressing the preference to put an additional replica to this cluster workload object. 0 by default.\",\n        \"format\": \"int64\",\n        \"type\": \"integer\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"description\": \"A mapping between cluster names and preferences regarding a local workload object (dep, rs, .. ) in these clusters. \\\"*\\\" (if provided) applies to all clusters if an explicit mapping is not provided. If omitted, clusters without explicit preferences should not have any replicas scheduled.\",\n     \"type\": \"object\"\n    },\n    \"intersectWithClusterSelector\": {\n     \"description\": \"If set to true, the placement of target kind will be determined using the instersection of RSP placement scheduling result and the clusterSelector (spec.placement.clusterSelector) specified on the target kind. If set to false or not defined, RSP placement scheduling result overwrites the clusters list in the spec.placement.clusters of the target resource.\",\n     \"type\": \"boolean\"\n    },\n    \"rebalance\": {\n     \"description\": \"If set to true then already scheduled and running replicas may be moved to other clusters in order to match current state to the specified preferences. Otherwise, if set to false, up and running replicas will not be moved.\",\n     \"type\": \"boolean\"\n    },\n    \"targetKind\": {\n     \"description\": \"TODO (@irfanurrehman); upgrade this to label selector only if need be. The idea of this API is to have a a set of preferences which can be used for a target FederatedDeployment or FederatedReplicaset. Although the set of preferences in question can be applied to multiple target objects using label selectors, but there are no clear advantages of doing that as of now. To keep the implementation and usage simple, matching ns/name of RSP resource to the target resource is sufficient and only additional information needed in RSP resource is a target kind (FederatedDeployment or FederatedReplicaset).\",\n     \"type\": \"string\"\n    },\n    \"totalReplicas\": {\n     \"description\": \"Total number of pods desired across federated clusters. Replicas specified in the spec for target deployment template or replicaset template will be discarded/overridden when scheduling preferences are specified.\",\n     \"format\": \"int32\",\n     \"type\": \"integer\"\n    }\n   },\n   \"required\": [\n    \"targetKind\",\n    \"totalReplicas\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Replica Scheduling Preference\",\n \"type\": \"object\"\n}"}