{"kind":"EventBus","apiVersion":"eventbridge.services.k8s.aws/v1alpha1","displayName":"Event Bus","format":"JSON","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","metadata":{"isNamespaced":true},"model":{"name":"aws-eventbridge-controller","version":"1.0.5","displayName":"aws-eventbridge-controller","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","category":{"name":"","metadata":null},"metadata":{},"components":null,"relationships":null},"schema":"{\n \"description\": \"EventBus is the Schema for the EventBuses API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"EventBusSpec defines the desired state of EventBus. \\n An event bus receives events from a source, uses rules to evaluate them, applies any configured input transformation, and routes them to the appropriate target(s). Your account's default event bus receives events from Amazon Web Services services. A custom event bus can receive events from your custom applications and services. A partner event bus receives events from an event source created by an SaaS partner. These events come from the partners services or applications.\",\n   \"properties\": {\n    \"eventSourceName\": {\n     \"description\": \"If you are creating a partner event bus, this specifies the partner event source that the new event bus will be matched with.\",\n     \"type\": \"string\"\n    },\n    \"name\": {\n     \"description\": \"The name of the new event bus. \\n Custom event bus names can't contain the / character, but you can use the / character in partner event bus names. In addition, for partner event buses, the name must exactly match the name of the partner event source that this event bus is matched to. \\n You can't use the name default for a custom event bus, as this name is already used for your account's default event bus.\",\n     \"type\": \"string\"\n    },\n    \"tags\": {\n     \"description\": \"Tags to associate with the event bus.\",\n     \"items\": {\n      \"description\": \"A key-value pair associated with an Amazon Web Services resource. In EventBridge, rules and event buses support tagging.\",\n      \"properties\": {\n       \"key\": {\n        \"type\": \"string\"\n       },\n       \"value\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    }\n   },\n   \"required\": [\n    \"name\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Event Bus\",\n \"type\": \"object\"\n}"}