{"kind":"ClusterWorkloadResourceMapping","apiVersion":"servicebinding.io/v1alpha3","displayName":"Cluster Workload Resource Mapping","format":"JSON","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","metadata":{"isNamespaced":false},"model":{"name":"service-binding-operator","version":"1.3.3","displayName":"service-binding-operator","hostname":"","hostID":"00000000-0000-0000-0000-000000000000","displayhostname":"","category":{"name":"","metadata":null},"metadata":{"source_uri":"https://redhat-developer.github.io/service-binding-operator-helm-chart/service-binding-operator-1.4.1.tgz"}},"schema":"{\n \"description\": \"ClusterWorkloadResourceMapping is the Schema for the clusterworkloadresourcemappings API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"ClusterWorkloadResourceMappingSpec defines the desired state of ClusterWorkloadResourceMapping\",\n   \"properties\": {\n    \"versions\": {\n     \"description\": \"Versions is the collection of versions for a given resource, with mappings.\",\n     \"items\": {\n      \"description\": \"ClusterWorkloadResourceMappingTemplate defines the mapping for a specific version of an workload resource to a logical PodTemplateSpec-like structure.\",\n      \"properties\": {\n       \"annotations\": {\n        \"description\": \"Annotations is a Restricted JSONPath that references the annotations map within the workload resource. These annotations must end up in the resulting Pod, and are generally not the workload resource's annotations. Defaults to `.spec.template.metadata.annotations`.\",\n        \"type\": \"string\"\n       },\n       \"containers\": {\n        \"description\": \"Containers is the collection of mappings to container-like fragments of the workload resource. Defaults to mappings appropriate for a PodSpecable resource.\",\n        \"items\": {\n         \"description\": \"ClusterWorkloadResourceMappingContainer defines the mapping for a specific fragment of an workload resource to a Container-like structure. \\n Each mapping defines exactly one path that may match multiple container-like fragments within the workload resource. For each object matching the path the name, env and volumeMounts expressions are resolved to find those structures.\",\n         \"properties\": {\n          \"env\": {\n           \"description\": \"Env is a Restricted JSONPath that references the slice of environment variables for the container with the container-like workload resource fragment. The referenced location is created if it does not exist. Defaults to `.envs`.\",\n           \"type\": \"string\"\n          },\n          \"name\": {\n           \"description\": \"Name is a Restricted JSONPath that references the name of the container with the container-like workload resource fragment. If not defined, container name filtering is ignored.\",\n           \"type\": \"string\"\n          },\n          \"path\": {\n           \"description\": \"Path is the JSONPath within the workload resource that matches an existing fragment that is container-like.\",\n           \"type\": \"string\"\n          },\n          \"volumeMounts\": {\n           \"description\": \"VolumeMounts is a Restricted JSONPath that references the slice of volume mounts for the container with the container-like workload resource fragment. The referenced location is created if it does not exist. Defaults to `.volumeMounts`.\",\n           \"type\": \"string\"\n          }\n         },\n         \"required\": [\n          \"path\"\n         ],\n         \"type\": \"object\"\n        },\n        \"type\": \"array\"\n       },\n       \"version\": {\n        \"description\": \"Version is the version of the workload resource that this mapping is for.\",\n        \"type\": \"string\"\n       },\n       \"volumes\": {\n        \"description\": \"Volumes is a Restricted JSONPath that references the slice of volumes within the workload resource. Defaults to `.spec.template.spec.volumes`.\",\n        \"type\": \"string\"\n       }\n      },\n      \"required\": [\n       \"version\"\n      ],\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    }\n   },\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Cluster Workload Resource Mapping\",\n \"type\": \"object\"\n}"}