{
  "capabilities": null,
  "component": {
   "kind": "ServiceDefaults",
   "schema": "{\n \"description\": \"ServiceDefaults is the Schema for the servicedefaults API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"ServiceDefaultsSpec defines the desired state of ServiceDefaults.\",\n   \"properties\": {\n    \"balanceInboundConnections\": {\n     \"description\": \"BalanceInboundConnections sets the strategy for allocating inbound connections to the service across proxy threads. The only supported value is exact_balance. By default, no connection balancing is used. Refer to the Envoy Connection Balance config for details.\",\n     \"type\": \"string\"\n    },\n    \"destination\": {\n     \"description\": \"Destination is an address(es)/port combination that represents an endpoint outside the mesh. This is only valid when the mesh is configured in \\\"transparent\\\" mode. Destinations live outside of Consul's catalog, and because of this, they do not require an artificial node to be created.\",\n     \"properties\": {\n      \"addresses\": {\n       \"description\": \"Addresses is a list of IPs and/or hostnames that can be dialed and routed through a terminating gateway.\",\n       \"items\": {\n        \"type\": \"string\"\n       },\n       \"type\": \"array\"\n      },\n      \"port\": {\n       \"description\": \"Port is the port that can be dialed on any of the addresses in this Destination.\",\n       \"format\": \"int32\",\n       \"type\": \"integer\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"envoyExtensions\": {\n     \"description\": \"EnvoyExtensions are a list of extensions to modify Envoy proxy configuration.\",\n     \"items\": {\n      \"description\": \"EnvoyExtension has configuration for an extension that patches Envoy resources.\",\n      \"properties\": {\n       \"arguments\": {\n        \"format\": \"textarea\",\n        \"type\": \"string\"\n       },\n       \"name\": {\n        \"type\": \"string\"\n       },\n       \"required\": {\n        \"type\": \"boolean\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    },\n    \"expose\": {\n     \"description\": \"Expose controls the default expose path configuration for Envoy.\",\n     \"properties\": {\n      \"checks\": {\n       \"description\": \"Checks defines whether paths associated with Consul checks will be exposed. This flag triggers exposing all HTTP and GRPC check paths registered for the service.\",\n       \"type\": \"boolean\"\n      },\n      \"paths\": {\n       \"description\": \"Paths is the list of paths exposed through the proxy.\",\n       \"items\": {\n        \"properties\": {\n         \"listenerPort\": {\n          \"description\": \"ListenerPort defines the port of the proxy's listener for exposed paths.\",\n          \"type\": \"integer\"\n         },\n         \"localPathPort\": {\n          \"description\": \"LocalPathPort is the port that the service is listening on for the given path.\",\n          \"type\": \"integer\"\n         },\n         \"path\": {\n          \"description\": \"Path is the path to expose through the proxy, ie. \\\"/metrics\\\".\",\n          \"type\": \"string\"\n         },\n         \"protocol\": {\n          \"description\": \"Protocol describes the upstream's service protocol. Valid values are \\\"http\\\" and \\\"http2\\\", defaults to \\\"http\\\".\",\n          \"type\": \"string\"\n         }\n        },\n        \"type\": \"object\"\n       },\n       \"type\": \"array\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"externalSNI\": {\n     \"description\": \"ExternalSNI is an optional setting that allows for the TLS SNI value to be changed to a non-connect value when federating with an external system.\",\n     \"type\": \"string\"\n    },\n    \"localConnectTimeoutMs\": {\n     \"description\": \"LocalConnectTimeoutMs is the number of milliseconds allowed to make connections to the local application instance before timing out. Defaults to 5000.\",\n     \"type\": \"integer\"\n    },\n    \"localRequestTimeoutMs\": {\n     \"description\": \"LocalRequestTimeoutMs is the timeout for HTTP requests to the local application instance in milliseconds. Applies to HTTP-based protocols only. If not specified, inherits the Envoy default for route timeouts (15s).\",\n     \"type\": \"integer\"\n    },\n    \"maxInboundConnections\": {\n     \"description\": \"MaxInboundConnections is the maximum number of concurrent inbound connections to each service instance. Defaults to 0 (using consul's default) if not set.\",\n     \"type\": \"integer\"\n    },\n    \"meshGateway\": {\n     \"description\": \"MeshGateway controls the default mesh gateway configuration for this service.\",\n     \"properties\": {\n      \"mode\": {\n       \"description\": \"Mode is the mode that should be used for the upstream connection. One of none, local, or remote.\",\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"mode\": {\n     \"description\": \"Mode can be one of \\\"direct\\\" or \\\"transparent\\\". \\\"transparent\\\" represents that inbound and outbound application traffic is being captured and redirected through the proxy. This mode does not enable the traffic redirection itself. Instead it signals Consul to configure Envoy as if traffic is already being redirected. \\\"direct\\\" represents that the proxy's listeners must be dialed directly by the local application and other proxies. Note: This cannot be set using the CRD and should be set using annotations on the services that are part of the mesh.\",\n     \"type\": \"string\"\n    },\n    \"mutualTLSMode\": {\n     \"description\": \"MutualTLSMode controls whether mutual TLS is required for all incoming connections when transparent proxy is enabled. This can be set to \\\"permissive\\\" or \\\"strict\\\". \\\"strict\\\" is the default which requires mutual TLS for incoming connections. In the insecure \\\"permissive\\\" mode, connections to the sidecar proxy public listener port require mutual TLS, but connections to the service port do not require mutual TLS and are proxied to the application unmodified. Note: Intentions are not enforced for non-mTLS connections. To keep your services secure, we recommend using \\\"strict\\\" mode whenever possible and enabling \\\"permissive\\\" mode only when necessary.\",\n     \"type\": \"string\"\n    },\n    \"protocol\": {\n     \"description\": \"Protocol sets the protocol of the service. This is used by Connect proxies for things like observability features and to unlock usage of the service-splitter and service-router config entries for a service.\",\n     \"type\": \"string\"\n    },\n    \"rateLimits\": {\n     \"description\": \"RateLimits is rate limiting configuration that is applied to inbound traffic for a service. Rate limiting is a Consul enterprise feature.\",\n     \"properties\": {\n      \"instanceLevel\": {\n       \"description\": \"InstanceLevel represents rate limit configuration that is applied per service instance.\",\n       \"properties\": {\n        \"requestsMaxBurst\": {\n         \"description\": \"RequestsMaxBurst is the maximum number of requests that can be sent in a burst. Should be equal to or greater than RequestsPerSecond. If unset, defaults to RequestsPerSecond. \\n Internally, this is the maximum size of the token bucket used for rate limiting.\",\n         \"type\": \"integer\"\n        },\n        \"requestsPerSecond\": {\n         \"description\": \"RequestsPerSecond is the average number of requests per second that can be made without being throttled. This field is required if RequestsMaxBurst is set. The allowed number of requests may exceed RequestsPerSecond up to the value specified in RequestsMaxBurst. \\n Internally, this is the refill rate of the token bucket used for rate limiting.\",\n         \"type\": \"integer\"\n        },\n        \"routes\": {\n         \"description\": \"Routes is a list of rate limits applied to specific routes. For a given request, the first matching route will be applied, if any. Overrides any top-level configuration.\",\n         \"items\": {\n          \"properties\": {\n           \"pathExact\": {\n            \"description\": \"Exact path to match. Exactly one of PathExact, PathPrefix, or PathRegex must be specified.\",\n            \"type\": \"string\"\n           },\n           \"pathPrefix\": {\n            \"description\": \"Prefix to match. Exactly one of PathExact, PathPrefix, or PathRegex must be specified.\",\n            \"type\": \"string\"\n           },\n           \"pathRegex\": {\n            \"description\": \"Regex to match. Exactly one of PathExact, PathPrefix, or PathRegex must be specified.\",\n            \"type\": \"string\"\n           },\n           \"requestsMaxBurst\": {\n            \"description\": \"RequestsMaxBurst is the maximum number of requests that can be sent in a burst. Should be equal to or greater than RequestsPerSecond. If unset, defaults to RequestsPerSecond. Internally, this is the maximum size of the token bucket used for rate limiting.\",\n            \"type\": \"integer\"\n           },\n           \"requestsPerSecond\": {\n            \"description\": \"RequestsPerSecond is the average number of requests per second that can be made without being throttled. This field is required if RequestsMaxBurst is set. The allowed number of requests may exceed RequestsPerSecond up to the value specified in RequestsMaxBurst. Internally, this is the refill rate of the token bucket used for rate limiting.\",\n            \"type\": \"integer\"\n           }\n          },\n          \"type\": \"object\"\n         },\n         \"type\": \"array\"\n        }\n       },\n       \"type\": \"object\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"transparentProxy\": {\n     \"description\": \"TransparentProxy controls configuration specific to proxies in transparent mode. Note: This cannot be set using the CRD and should be set using annotations on the services that are part of the mesh.\",\n     \"properties\": {\n      \"dialedDirectly\": {\n       \"description\": \"DialedDirectly indicates whether transparent proxies can dial this proxy instance directly. The discovery chain is not considered when dialing a service instance directly. This setting is useful when addressing stateful services, such as a database cluster with a leader node.\",\n       \"type\": \"boolean\"\n      },\n      \"outboundListenerPort\": {\n       \"description\": \"OutboundListenerPort is the port of the listener where outbound application traffic is being redirected to.\",\n       \"type\": \"integer\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"upstreamConfig\": {\n     \"description\": \"UpstreamConfig controls default configuration settings that apply across all upstreams, and per-upstream configuration overrides. Note that per-upstream configuration applies across all federated datacenters to the pairing of source and upstream destination services.\",\n     \"properties\": {\n      \"defaults\": {\n       \"description\": \"Defaults contains default configuration for all upstreams of a given service. The name field must be empty.\",\n       \"properties\": {\n        \"connectTimeoutMs\": {\n         \"description\": \"ConnectTimeoutMs is the number of milliseconds to timeout making a new connection to this upstream. Defaults to 5000 (5 seconds) if not set.\",\n         \"type\": \"integer\"\n        },\n        \"envoyClusterJSON\": {\n         \"description\": \"EnvoyClusterJSON is a complete override (\\\"escape hatch\\\") for the upstream's cluster. The Connect client TLS certificate and context will be injected overriding any TLS settings present. Note: This escape hatch is NOT compatible with the discovery chain and will be ignored if a discovery chain is active.\",\n         \"type\": \"string\"\n        },\n        \"envoyListenerJSON\": {\n         \"description\": \"EnvoyListenerJSON is a complete override (\\\"escape hatch\\\") for the upstream's listener. Note: This escape hatch is NOT compatible with the discovery chain and will be ignored if a discovery chain is active.\",\n         \"type\": \"string\"\n        },\n        \"limits\": {\n         \"description\": \"Limits are the set of limits that are applied to the proxy for a specific upstream of a service instance.\",\n         \"properties\": {\n          \"maxConcurrentRequests\": {\n           \"description\": \"MaxConcurrentRequests is the maximum number of in-flight requests that will be allowed to the upstream cluster at a point in time. This is mostly applicable to HTTP/2 clusters since all HTTP/1.1 requests are limited by MaxConnections.\",\n           \"type\": \"integer\"\n          },\n          \"maxConnections\": {\n           \"description\": \"MaxConnections is the maximum number of connections the local proxy can make to the upstream service.\",\n           \"type\": \"integer\"\n          },\n          \"maxPendingRequests\": {\n           \"description\": \"MaxPendingRequests is the maximum number of requests that will be queued waiting for an available connection. This is mostly applicable to HTTP/1.1 clusters since all HTTP/2 requests are streamed over a single connection.\",\n           \"type\": \"integer\"\n          }\n         },\n         \"type\": \"object\"\n        },\n        \"meshGateway\": {\n         \"description\": \"MeshGatewayConfig controls how Mesh Gateways are configured and used.\",\n         \"properties\": {\n          \"mode\": {\n           \"description\": \"Mode is the mode that should be used for the upstream connection. One of none, local, or remote.\",\n           \"type\": \"string\"\n          }\n         },\n         \"type\": \"object\"\n        },\n        \"name\": {\n         \"description\": \"Name is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n         \"type\": \"string\"\n        },\n        \"namespace\": {\n         \"description\": \"Namespace is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n         \"type\": \"string\"\n        },\n        \"partition\": {\n         \"description\": \"Partition is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n         \"type\": \"string\"\n        },\n        \"passiveHealthCheck\": {\n         \"description\": \"PassiveHealthCheck configuration determines how upstream proxy instances will be monitored for removal from the load balancing pool.\",\n         \"properties\": {\n          \"baseEjectionTime\": {\n           \"description\": \"The base time that a host is ejected for. The real time is equal to the base time multiplied by the number of times the host has been ejected and is capped by max_ejection_time (Default 300s). Defaults to 30s.\",\n           \"type\": \"string\"\n          },\n          \"enforcingConsecutive5xx\": {\n           \"description\": \"EnforcingConsecutive5xx is the % chance that a host will be actually ejected when an outlier status is detected through consecutive 5xx. This setting can be used to disable ejection or to ramp it up slowly. Ex. Setting this to 10 will make it a 10% chance that the host will be ejected.\",\n           \"format\": \"int32\",\n           \"type\": \"integer\"\n          },\n          \"interval\": {\n           \"description\": \"Interval between health check analysis sweeps. Each sweep may remove hosts or return hosts to the pool. Ex. setting this to \\\"10s\\\" will set the interval to 10 seconds.\",\n           \"type\": \"string\"\n          },\n          \"maxEjectionPercent\": {\n           \"description\": \"The maximum % of an upstream cluster that can be ejected due to outlier detection. Defaults to 10% but will eject at least one host regardless of the value.\",\n           \"format\": \"int32\",\n           \"type\": \"integer\"\n          },\n          \"maxFailures\": {\n           \"description\": \"MaxFailures is the count of consecutive failures that results in a host being removed from the pool.\",\n           \"format\": \"int32\",\n           \"type\": \"integer\"\n          }\n         },\n         \"type\": \"object\"\n        },\n        \"peer\": {\n         \"description\": \"Peer is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n         \"type\": \"string\"\n        },\n        \"protocol\": {\n         \"description\": \"Protocol describes the upstream's service protocol. Valid values are \\\"tcp\\\", \\\"http\\\" and \\\"grpc\\\". Anything else is treated as tcp. This enables protocol aware features like per-request metrics and connection pooling, tracing, routing etc.\",\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      },\n      \"overrides\": {\n       \"description\": \"Overrides is a slice of per-service configuration. The name field is required.\",\n       \"items\": {\n        \"properties\": {\n         \"connectTimeoutMs\": {\n          \"description\": \"ConnectTimeoutMs is the number of milliseconds to timeout making a new connection to this upstream. Defaults to 5000 (5 seconds) if not set.\",\n          \"type\": \"integer\"\n         },\n         \"envoyClusterJSON\": {\n          \"description\": \"EnvoyClusterJSON is a complete override (\\\"escape hatch\\\") for the upstream's cluster. The Connect client TLS certificate and context will be injected overriding any TLS settings present. Note: This escape hatch is NOT compatible with the discovery chain and will be ignored if a discovery chain is active.\",\n          \"type\": \"string\"\n         },\n         \"envoyListenerJSON\": {\n          \"description\": \"EnvoyListenerJSON is a complete override (\\\"escape hatch\\\") for the upstream's listener. Note: This escape hatch is NOT compatible with the discovery chain and will be ignored if a discovery chain is active.\",\n          \"type\": \"string\"\n         },\n         \"limits\": {\n          \"description\": \"Limits are the set of limits that are applied to the proxy for a specific upstream of a service instance.\",\n          \"properties\": {\n           \"maxConcurrentRequests\": {\n            \"description\": \"MaxConcurrentRequests is the maximum number of in-flight requests that will be allowed to the upstream cluster at a point in time. This is mostly applicable to HTTP/2 clusters since all HTTP/1.1 requests are limited by MaxConnections.\",\n            \"type\": \"integer\"\n           },\n           \"maxConnections\": {\n            \"description\": \"MaxConnections is the maximum number of connections the local proxy can make to the upstream service.\",\n            \"type\": \"integer\"\n           },\n           \"maxPendingRequests\": {\n            \"description\": \"MaxPendingRequests is the maximum number of requests that will be queued waiting for an available connection. This is mostly applicable to HTTP/1.1 clusters since all HTTP/2 requests are streamed over a single connection.\",\n            \"type\": \"integer\"\n           }\n          },\n          \"type\": \"object\"\n         },\n         \"meshGateway\": {\n          \"description\": \"MeshGatewayConfig controls how Mesh Gateways are configured and used.\",\n          \"properties\": {\n           \"mode\": {\n            \"description\": \"Mode is the mode that should be used for the upstream connection. One of none, local, or remote.\",\n            \"type\": \"string\"\n           }\n          },\n          \"type\": \"object\"\n         },\n         \"name\": {\n          \"description\": \"Name is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n          \"type\": \"string\"\n         },\n         \"namespace\": {\n          \"description\": \"Namespace is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n          \"type\": \"string\"\n         },\n         \"partition\": {\n          \"description\": \"Partition is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n          \"type\": \"string\"\n         },\n         \"passiveHealthCheck\": {\n          \"description\": \"PassiveHealthCheck configuration determines how upstream proxy instances will be monitored for removal from the load balancing pool.\",\n          \"properties\": {\n           \"baseEjectionTime\": {\n            \"description\": \"The base time that a host is ejected for. The real time is equal to the base time multiplied by the number of times the host has been ejected and is capped by max_ejection_time (Default 300s). Defaults to 30s.\",\n            \"type\": \"string\"\n           },\n           \"enforcingConsecutive5xx\": {\n            \"description\": \"EnforcingConsecutive5xx is the % chance that a host will be actually ejected when an outlier status is detected through consecutive 5xx. This setting can be used to disable ejection or to ramp it up slowly. Ex. Setting this to 10 will make it a 10% chance that the host will be ejected.\",\n            \"format\": \"int32\",\n            \"type\": \"integer\"\n           },\n           \"interval\": {\n            \"description\": \"Interval between health check analysis sweeps. Each sweep may remove hosts or return hosts to the pool. Ex. setting this to \\\"10s\\\" will set the interval to 10 seconds.\",\n            \"type\": \"string\"\n           },\n           \"maxEjectionPercent\": {\n            \"description\": \"The maximum % of an upstream cluster that can be ejected due to outlier detection. Defaults to 10% but will eject at least one host regardless of the value.\",\n            \"format\": \"int32\",\n            \"type\": \"integer\"\n           },\n           \"maxFailures\": {\n            \"description\": \"MaxFailures is the count of consecutive failures that results in a host being removed from the pool.\",\n            \"format\": \"int32\",\n            \"type\": \"integer\"\n           }\n          },\n          \"type\": \"object\"\n         },\n         \"peer\": {\n          \"description\": \"Peer is only accepted within service ServiceDefaultsSpec.UpstreamConfig.Overrides config entry.\",\n          \"type\": \"string\"\n         },\n         \"protocol\": {\n          \"description\": \"Protocol describes the upstream's service protocol. Valid values are \\\"tcp\\\", \\\"http\\\" and \\\"grpc\\\". Anything else is treated as tcp. This enables protocol aware features like per-request metrics and connection pooling, tracing, routing etc.\",\n          \"type\": \"string\"\n         }\n        },\n        \"type\": \"object\"\n       },\n       \"type\": \"array\"\n      }\n     },\n     \"type\": \"object\"\n    }\n   },\n   \"type\": \"object\"\n  }\n },\n \"title\": \"Service Defaults\",\n \"type\": \"object\"\n}",
   "version": "consul.hashicorp.com/v1alpha1"
  },
  "configuration": null,
  "description": "",
  "displayName": "Service Defaults",
  "format": "JSON",
  "id": "00000000-0000-0000-0000-000000000000",
  "metadata": {
   "genealogy": "",
   "isAnnotation": false,
   "isNamespaced": true,
   "published": false,
   "source_uri": "git://github.com/hashicorp/consul-k8s/main/control-plane/config/crd/bases"
  },
  "model": {
   "category": {
    "name": "Cloud Native Network"
   },
   "displayName": "Consul",
   "id": "00000000-0000-0000-0000-000000000000",
   "metadata": {
    "isAnnotation": false,
    "primaryColor": "#D62783",
    "secondaryColor": "#ed74b4",
    "shape": "circle",
    "source_uri": "git://github.com/hashicorp/consul-k8s/main/control-plane/config/crd/bases",
    "styleOverrides": "",
    "svgColor": "\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\u003c!DOCTYPE svg\u003e\u003csvg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 20 20\" fill=\"none\"\u003e\u003cg xmlns=\"http://www.w3.org/2000/svg\" clip-path=\"url(#a)\" fill=\"#e03875\"\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M9.626 12.114c-1.17 0-2.082-.94-2.082-2.147 0-1.208.911-2.148 2.082-2.148 1.17 0 2.081.94 2.081 2.148 0 1.208-.91 2.147-2.081 2.147Zm4.064-1.14a.994.994 0 0 1-.975-1.007c0-.537.423-1.007.976-1.007.52 0 .975.436.975 1.007a.994.994 0 0 1-.975 1.006Zm3.513.939a.947.947 0 0 1-1.17.704c-.521-.134-.814-.67-.684-1.208a.948.948 0 0 1 1.17-.705.985.985 0 0 1 .716 1.141s0 .034-.033.067h.001Zm-.684-2.551c-.52.134-1.04-.202-1.17-.739a1.002 1.002 0 0 1 .715-1.208c.52-.134 1.04.202 1.17.739a.843.843 0 0 1 0 .402.91.91 0 0 1-.715.806Zm3.446 2.416c-.098.536-.585.906-1.105.805a.984.984 0 0 1-.78-1.14c.097-.538.584-.907 1.105-.806.488.1.846.57.813 1.073-.032.034-.032.034-.032.068Zm-.779-2.482c-.52.1-1.008-.269-1.105-.806a.984.984 0 0 1 .78-1.14c.52-.101 1.008.268 1.106.805 0 .1.033.168 0 .268a.951.951 0 0 1-.78.873Zm-.682 5.94a.941.941 0 0 1-1.301.368 1.005 1.005 0 0 1-.358-1.342.941.941 0 0 1 1.3-.37c.326.202.521.571.489.94a1.934 1.934 0 0 1-.13.403Zm-.358-9.128a.941.941 0 0 1-1.3-.37 1.005 1.005 0 0 1 .357-1.342.941.941 0 0 1 1.3.37c.098.2.13.369.13.57a1.007 1.007 0 0 1-.487.772\"\u003e\u003c/path\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" d=\"M9.658 20c-2.601 0-5.008-1.04-6.861-2.92A10.35 10.35 0 0 1 0 10c0-2.685 1.008-5.168 2.83-7.081C4.65 1.04 7.09 0 9.657 0a9.4 9.4 0 0 1 5.886 2.047l-1.203 1.61c-1.364-1.071-2.99-1.642-4.68-1.642-2.049 0-4 .839-5.463 2.349C2.733 5.873 1.952 7.853 1.952 10a8.08 8.08 0 0 0 2.277 5.638 7.5 7.5 0 0 0 5.463 2.315 7.4 7.4 0 0 0 4.683-1.644l1.17 1.61C13.855 19.261 11.805 20 9.66 20Z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003cdefs xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cclipPath xmlns=\"http://www.w3.org/2000/svg\" id=\"a\"\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" fill=\"#fff\" d=\"M0 0h20v20H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003c/svg\u003e",
    "svgComplete": "",
    "svgWhite": "\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\u003c!DOCTYPE svg\u003e\u003csvg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 32 32\" fill=\"none\"\u003e\u003cg xmlns=\"http://www.w3.org/2000/svg\" clip-path=\"url(#a)\" fill=\"#fff\"\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M15.401 19.383c-1.873 0-3.33-1.503-3.33-3.436s1.457-3.436 3.33-3.436 3.33 1.503 3.33 3.436-1.457 3.436-3.33 3.436Zm6.504-1.825c-.832 0-1.56-.698-1.56-1.611 0-.86.675-1.61 1.56-1.61.832 0 1.561.697 1.561 1.61 0 .913-.728 1.61-1.56 1.61Zm5.62 1.503a1.516 1.516 0 0 1-1.874 1.126c-.832-.214-1.3-1.073-1.092-1.932a1.516 1.516 0 0 1 1.873-1.128c.779.214 1.3.966 1.144 1.825 0 0 0 .054-.052.107v.002Zm-1.095-4.082c-.833.214-1.665-.323-1.873-1.182a1.604 1.604 0 0 1 1.145-1.933c.832-.215 1.664.323 1.872 1.182.052.215.052.43 0 .644-.052.59-.468 1.128-1.144 1.289Zm5.515 3.865c-.157.859-.938 1.45-1.77 1.289a1.574 1.574 0 0 1-1.248-1.826c.155-.858.936-1.45 1.768-1.288.781.16 1.354.912 1.302 1.718-.052.053-.052.053-.052.107Zm-1.247-3.971c-.832.161-1.613-.43-1.769-1.288a1.575 1.575 0 0 1 1.25-1.826c.832-.161 1.612.43 1.768 1.289 0 .16.052.268 0 .429-.052.698-.572 1.289-1.249 1.396Zm-1.092 9.503c-.416.752-1.353 1.02-2.082.59-.728-.429-.988-1.395-.572-2.147.416-.752 1.353-1.02 2.081-.59.52.322.833.912.78 1.503-.051.215-.103.43-.207.644Zm-.573-14.603c-.728.43-1.665.16-2.08-.591-.417-.752-.157-1.718.572-2.148.728-.43 1.664-.16 2.08.591.157.322.209.59.209.913-.052.483-.312.966-.78 1.235\"\u003e\u003c/path\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" d=\"M15.453 32c-4.162 0-8.013-1.664-10.978-4.67A16.56 16.56 0 0 1 0 16c0-4.296 1.613-8.27 4.527-11.33C7.44 1.664 11.343 0 15.453 0c3.434 0 6.712 1.127 9.418 3.276l-1.924 2.576c-2.186-1.717-4.788-2.63-7.493-2.63-3.278 0-6.4 1.343-8.741 3.759-2.34 2.416-3.59 5.584-3.59 9.02 0 3.382 1.301 6.604 3.643 9.02 2.341 2.415 5.411 3.704 8.741 3.704 2.758 0 5.36-.913 7.492-2.63l1.874 2.576c-2.706 2.147-5.984 3.328-9.418 3.328l-.002.001Z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003cdefs xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cclipPath xmlns=\"http://www.w3.org/2000/svg\" id=\"a\"\u003e\u003cpath xmlns=\"http://www.w3.org/2000/svg\" fill=\"#fff\" d=\"M0 0h32v32H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003c/svg\u003e"
   },
   "model": {
    "version": "v1.5.1"
   },
   "name": "consul",
   "registrant": {
    "created_at": "0001-01-01T00:00:00Z",
    "credential_id": "00000000-0000-0000-0000-000000000000",
    "deleted_at": "0001-01-01T00:00:00Z",
    "id": "00000000-0000-0000-0000-000000000000",
    "kind": "github",
    "name": "Github",
    "status": "discovered",
    "sub_type": "",
    "type": "registry",
    "updated_at": "0001-01-01T00:00:00Z",
    "user_id": "00000000-0000-0000-0000-000000000000"
   },
   "connection_id": "00000000-0000-0000-0000-000000000000",
   "schemaVersion": "models.meshery.io/v1beta1",
   "status": "ignored",
   "subCategory": "Service Mesh",
   "version": "v1.0.0",
   "components": null,
   "relationships": null
  },
  "schemaVersion": "components.meshery.io/v1beta1",
  "status": "ignored",
  "styles": {
   "primaryColor": "#D62783",
   "secondaryColor": "#ed74b4",
   "shape": "circle",
   "svgColor": "\u003csvg width=\"20\" height=\"20\" viewBox=\"0 0 20 20\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cg clip-path=\"url(#a)\" fill=\"#e03875\"\u003e\u003cpath fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M9.626 12.114c-1.17 0-2.082-.94-2.082-2.147 0-1.208.911-2.148 2.082-2.148 1.17 0 2.081.94 2.081 2.148 0 1.208-.91 2.147-2.081 2.147Zm4.064-1.14a.994.994 0 0 1-.975-1.007c0-.537.423-1.007.976-1.007.52 0 .975.436.975 1.007a.994.994 0 0 1-.975 1.006Zm3.513.939a.947.947 0 0 1-1.17.704c-.521-.134-.814-.67-.684-1.208a.948.948 0 0 1 1.17-.705.985.985 0 0 1 .716 1.141s0 .034-.033.067h.001Zm-.684-2.551c-.52.134-1.04-.202-1.17-.739a1.002 1.002 0 0 1 .715-1.208c.52-.134 1.04.202 1.17.739a.843.843 0 0 1 0 .402.91.91 0 0 1-.715.806Zm3.446 2.416c-.098.536-.585.906-1.105.805a.984.984 0 0 1-.78-1.14c.097-.538.584-.907 1.105-.806.488.1.846.57.813 1.073-.032.034-.032.034-.032.068Zm-.779-2.482c-.52.1-1.008-.269-1.105-.806a.984.984 0 0 1 .78-1.14c.52-.101 1.008.268 1.106.805 0 .1.033.168 0 .268a.951.951 0 0 1-.78.873Zm-.682 5.94a.941.941 0 0 1-1.301.368 1.005 1.005 0 0 1-.358-1.342.941.941 0 0 1 1.3-.37c.326.202.521.571.489.94a1.934 1.934 0 0 1-.13.403Zm-.358-9.128a.941.941 0 0 1-1.3-.37 1.005 1.005 0 0 1 .357-1.342.941.941 0 0 1 1.3.37c.098.2.13.369.13.57a1.007 1.007 0 0 1-.487.772\"/\u003e\u003cpath d=\"M9.658 20c-2.601 0-5.008-1.04-6.861-2.92A10.35 10.35 0 0 1 0 10c0-2.685 1.008-5.168 2.83-7.081C4.65 1.04 7.09 0 9.657 0a9.4 9.4 0 0 1 5.886 2.047l-1.203 1.61c-1.364-1.071-2.99-1.642-4.68-1.642-2.049 0-4 .839-5.463 2.349C2.733 5.873 1.952 7.853 1.952 10a8.08 8.08 0 0 0 2.277 5.638 7.5 7.5 0 0 0 5.463 2.315 7.4 7.4 0 0 0 4.683-1.644l1.17 1.61C13.855 19.261 11.805 20 9.66 20Z\"/\u003e\u003c/g\u003e\u003cdefs\u003e\u003cclipPath id=\"a\"\u003e\u003cpath fill=\"#fff\" d=\"M0 0h20v20H0z\"/\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003c/svg\u003e",
   "svgWhite": "\u003csvg width=\"32\" height=\"32\" viewBox=\"0 0 32 32\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cg clip-path=\"url(#a)\" fill=\"#fff\"\u003e\u003cpath fill-rule=\"evenodd\" clip-rule=\"evenodd\" d=\"M15.401 19.383c-1.873 0-3.33-1.503-3.33-3.436s1.457-3.436 3.33-3.436 3.33 1.503 3.33 3.436-1.457 3.436-3.33 3.436Zm6.504-1.825c-.832 0-1.56-.698-1.56-1.611 0-.86.675-1.61 1.56-1.61.832 0 1.561.697 1.561 1.61 0 .913-.728 1.61-1.56 1.61Zm5.62 1.503a1.516 1.516 0 0 1-1.874 1.126c-.832-.214-1.3-1.073-1.092-1.932a1.516 1.516 0 0 1 1.873-1.128c.779.214 1.3.966 1.144 1.825 0 0 0 .054-.052.107v.002Zm-1.095-4.082c-.833.214-1.665-.323-1.873-1.182a1.604 1.604 0 0 1 1.145-1.933c.832-.215 1.664.323 1.872 1.182.052.215.052.43 0 .644-.052.59-.468 1.128-1.144 1.289Zm5.515 3.865c-.157.859-.938 1.45-1.77 1.289a1.574 1.574 0 0 1-1.248-1.826c.155-.858.936-1.45 1.768-1.288.781.16 1.354.912 1.302 1.718-.052.053-.052.053-.052.107Zm-1.247-3.971c-.832.161-1.613-.43-1.769-1.288a1.575 1.575 0 0 1 1.25-1.826c.832-.161 1.612.43 1.768 1.289 0 .16.052.268 0 .429-.052.698-.572 1.289-1.249 1.396Zm-1.092 9.503c-.416.752-1.353 1.02-2.082.59-.728-.429-.988-1.395-.572-2.147.416-.752 1.353-1.02 2.081-.59.52.322.833.912.78 1.503-.051.215-.103.43-.207.644Zm-.573-14.603c-.728.43-1.665.16-2.08-.591-.417-.752-.157-1.718.572-2.148.728-.43 1.664-.16 2.08.591.157.322.209.59.209.913-.052.483-.312.966-.78 1.235\"/\u003e\u003cpath d=\"M15.453 32c-4.162 0-8.013-1.664-10.978-4.67A16.56 16.56 0 0 1 0 16c0-4.296 1.613-8.27 4.527-11.33C7.44 1.664 11.343 0 15.453 0c3.434 0 6.712 1.127 9.418 3.276l-1.924 2.576c-2.186-1.717-4.788-2.63-7.493-2.63-3.278 0-6.4 1.343-8.741 3.759-2.34 2.416-3.59 5.584-3.59 9.02 0 3.382 1.301 6.604 3.643 9.02 2.341 2.415 5.411 3.704 8.741 3.704 2.758 0 5.36-.913 7.492-2.63l1.874 2.576c-2.706 2.147-5.984 3.328-9.418 3.328l-.002.001Z\"/\u003e\u003c/g\u003e\u003cdefs\u003e\u003cclipPath id=\"a\"\u003e\u003cpath fill=\"#fff\" d=\"M0 0h32v32H0z\"/\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003c/svg\u003e"
  },
  "version": "v1.0.0"
 }