{"kind":"FederationDomain","apiVersion":"config.supervisor.pinniped.dev/v1alpha1","displayName":"Federation Domain","format":"JSON","metadata":{"genealogy":"","isNamespaced":true,"logoURL":"","model":"pinniped","modelDisplayName":"Pinniped","primaryColor":"#00B39F","published":false,"secondaryColor":"#00D3A9","shape":"circle","styleOverrides":"","subCategory":"Key Management","svgColor":"","svgComplete":"","svgWhite":""},"model":{"name":"pinniped","version":"1.0.8","displayName":"Pinniped","category":{"name":"Security \u0026 Compliance","metadata":null},"metadata":{"source_uri":"https://charts.bitnami.com/bitnami/pinniped-1.2.9.tgz"}},"schema":"{\n \"description\": \"FederationDomain describes the configuration of an OIDC provider.\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"Spec of the OIDC provider.\",\n   \"properties\": {\n    \"issuer\": {\n     \"description\": \"Issuer is the OIDC Provider's issuer, per the OIDC Discovery Metadata document, as well as the identifier that it will use for the iss claim in issued JWTs. This field will also be used as the base URL for any endpoints used by the OIDC Provider (e.g., if your issuer is https://example.com/foo, then your authorization endpoint will look like https://example.com/foo/some/path/to/auth/endpoint). \\n See https://openid.net/specs/openid-connect-discovery-1_0.html#rfc.section.3 for more information.\",\n     \"minLength\": 1,\n     \"type\": \"string\"\n    },\n    \"tls\": {\n     \"description\": \"TLS configures how this FederationDomain is served over Transport Layer Security (TLS).\",\n     \"properties\": {\n      \"secretName\": {\n       \"description\": \"SecretName is an optional name of a Secret in the same namespace, of type `kubernetes.io/tls`, which contains the TLS serving certificate for the HTTPS endpoints served by this FederationDomain. When provided, the TLS Secret named here must contain keys named `tls.crt` and `tls.key` that contain the certificate and private key to use for TLS. \\n Server Name Indication (SNI) is an extension to the Transport Layer Security (TLS) supported by all major browsers. \\n SecretName is required if you would like to use different TLS certificates for issuers of different hostnames. SNI requests do not include port numbers, so all issuers with the same DNS hostname must use the same SecretName value even if they have different port numbers. \\n SecretName is not required when you would like to use only the HTTP endpoints (e.g. when the HTTP listener is configured to listen on loopback interfaces or UNIX domain sockets for traffic from a service mesh sidecar). It is also not required when you would like all requests to this OIDC Provider's HTTPS endpoints to use the default TLS certificate, which is configured elsewhere. \\n When your Issuer URL's host is an IP address, then this field is ignored. SNI does not work for IP addresses.\",\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    }\n   },\n   \"required\": [\n    \"issuer\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"required\": [\n  \"spec\"\n ],\n \"title\": \"Federation Domain\",\n \"type\": \"object\"\n}"}