{"kind":"LDAPIdentityProvider","apiVersion":"idp.supervisor.pinniped.dev/v1alpha1","displayName":"LDAP Identity Provider","format":"JSON","metadata":{"genealogy":"","isNamespaced":true,"logoURL":"","model":"pinniped","modelDisplayName":"Pinniped","primaryColor":"#00B39F","published":false,"secondaryColor":"#00D3A9","shape":"circle","styleOverrides":"","subCategory":"Key Management","svgColor":"","svgComplete":"","svgWhite":""},"model":{"name":"pinniped","version":"1.0.8","displayName":"Pinniped","category":{"name":"Security \u0026 Compliance","metadata":null},"metadata":{"source_uri":"https://charts.bitnami.com/bitnami/pinniped-1.2.9.tgz"}},"schema":"{\n \"description\": \"LDAPIdentityProvider describes the configuration of an upstream Lightweight Directory Access Protocol (LDAP) identity provider.\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"Spec for configuring the identity provider.\",\n   \"properties\": {\n    \"bind\": {\n     \"description\": \"Bind contains the configuration for how to provide access credentials during an initial bind to the LDAP server to be allowed to perform searches and binds to validate a user's credentials during a user's authentication attempt.\",\n     \"properties\": {\n      \"secretName\": {\n       \"description\": \"SecretName contains the name of a namespace-local Secret object that provides the username and password for an LDAP bind user. This account will be used to perform LDAP searches. The Secret should be of type \\\"kubernetes.io/basic-auth\\\" which includes \\\"username\\\" and \\\"password\\\" keys. The username value should be the full dn (distinguished name) of your bind account, e.g. \\\"cn=bind-account,ou=users,dc=example,dc=com\\\". The password must be non-empty.\",\n       \"minLength\": 1,\n       \"type\": \"string\"\n      }\n     },\n     \"required\": [\n      \"secretName\"\n     ],\n     \"type\": \"object\"\n    },\n    \"groupSearch\": {\n     \"description\": \"GroupSearch contains the configuration for searching for a user's group membership in the LDAP provider.\",\n     \"properties\": {\n      \"attributes\": {\n       \"description\": \"Attributes specifies how the group's information should be read from each LDAP entry which was found as the result of the group search.\",\n       \"properties\": {\n        \"groupName\": {\n         \"description\": \"GroupName specifies the name of the attribute in the LDAP entries whose value shall become a group name in the user's list of groups after a successful authentication. The value of this field is case-sensitive and must match the case of the attribute name returned by the LDAP server in the user's entry. E.g. \\\"cn\\\" for common name. Distinguished names can be used by specifying lower-case \\\"dn\\\". Optional. When not specified, the default will act as if the GroupName were specified as \\\"dn\\\" (distinguished name).\",\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      },\n      \"base\": {\n       \"description\": \"Base is the dn (distinguished name) that should be used as the search base when searching for groups. E.g. \\\"ou=groups,dc=example,dc=com\\\". When not specified, no group search will be performed and authenticated users will not belong to any groups from the LDAP provider. Also, when not specified, the values of Filter and Attributes are ignored.\",\n       \"type\": \"string\"\n      },\n      \"filter\": {\n       \"description\": \"Filter is the LDAP search filter which should be applied when searching for groups for a user. The pattern \\\"{}\\\" must occur in the filter at least once and will be dynamically replaced by the dn (distinguished name) of the user entry found as a result of the user search. E.g. \\\"member={}\\\" or \\\"\\u0026(objectClass=groupOfNames)(member={})\\\". For more information about LDAP filters, see https://ldap.com/ldap-filters. Note that the dn (distinguished name) is not an attribute of an entry, so \\\"dn={}\\\" cannot be used. Optional. When not specified, the default will act as if the Filter were specified as \\\"member={}\\\".\",\n       \"type\": \"string\"\n      },\n      \"skipGroupRefresh\": {\n       \"description\": \"The user's group membership is refreshed as they interact with the supervisor to obtain new credentials (as their old credentials expire).  This allows group membership changes to be quickly reflected into Kubernetes clusters.  Since group membership is often used to bind authorization policies, it is important to keep the groups observed in Kubernetes clusters in-sync with the identity provider. \\n In some environments, frequent group membership queries may result in a significant performance impact on the identity provider and/or the supervisor. The best approach to handle performance impacts is to tweak the group query to be more performant, for example by disabling nested group search or by using a more targeted group search base. \\n If the group search query cannot be made performant and you are willing to have group memberships remain static for approximately a day, then set skipGroupRefresh to true.  This is an insecure configuration as authorization policies that are bound to group membership will not notice if a user has been removed from a particular group until their next login. \\n This is an experimental feature that may be removed or significantly altered in the future.  Consumers of this configuration should carefully read all release notes before upgrading to ensure that the meaning of this field has not changed.\",\n       \"type\": \"boolean\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"host\": {\n     \"description\": \"Host is the hostname of this LDAP identity provider, i.e., where to connect. For example: ldap.example.com:636.\",\n     \"minLength\": 1,\n     \"type\": \"string\"\n    },\n    \"tls\": {\n     \"description\": \"TLS contains the connection settings for how to establish the connection to the Host.\",\n     \"properties\": {\n      \"certificateAuthorityData\": {\n       \"description\": \"X.509 Certificate Authority (base64-encoded PEM bundle). If omitted, a default set of system roots will be trusted.\",\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"userSearch\": {\n     \"description\": \"UserSearch contains the configuration for searching for a user by name in the LDAP provider.\",\n     \"properties\": {\n      \"attributes\": {\n       \"description\": \"Attributes specifies how the user's information should be read from the LDAP entry which was found as the result of the user search.\",\n       \"properties\": {\n        \"uid\": {\n         \"description\": \"UID specifies the name of the attribute in the LDAP entry which whose value shall be used to uniquely identify the user within this LDAP provider after a successful authentication. E.g. \\\"uidNumber\\\" or \\\"objectGUID\\\". The value of this field is case-sensitive and must match the case of the attribute name returned by the LDAP server in the user's entry. Distinguished names can be used by specifying lower-case \\\"dn\\\".\",\n         \"minLength\": 1,\n         \"type\": \"string\"\n        },\n        \"username\": {\n         \"description\": \"Username specifies the name of the attribute in the LDAP entry whose value shall become the username of the user after a successful authentication. This would typically be the same attribute name used in the user search filter, although it can be different. E.g. \\\"mail\\\" or \\\"uid\\\" or \\\"userPrincipalName\\\". The value of this field is case-sensitive and must match the case of the attribute name returned by the LDAP server in the user's entry. Distinguished names can be used by specifying lower-case \\\"dn\\\". When this field is set to \\\"dn\\\" then the LDAPIdentityProviderUserSearch's Filter field cannot be blank, since the default value of \\\"dn={}\\\" would not work.\",\n         \"minLength\": 1,\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      },\n      \"base\": {\n       \"description\": \"Base is the dn (distinguished name) that should be used as the search base when searching for users. E.g. \\\"ou=users,dc=example,dc=com\\\".\",\n       \"minLength\": 1,\n       \"type\": \"string\"\n      },\n      \"filter\": {\n       \"description\": \"Filter is the LDAP search filter which should be applied when searching for users. The pattern \\\"{}\\\" must occur in the filter at least once and will be dynamically replaced by the username for which the search is being run. E.g. \\\"mail={}\\\" or \\\"\\u0026(objectClass=person)(uid={})\\\". For more information about LDAP filters, see https://ldap.com/ldap-filters. Note that the dn (distinguished name) is not an attribute of an entry, so \\\"dn={}\\\" cannot be used. Optional. When not specified, the default will act as if the Filter were specified as the value from Attributes.Username appended by \\\"={}\\\". When the Attributes.Username is set to \\\"dn\\\" then the Filter must be explicitly specified, since the default value of \\\"dn={}\\\" would not work.\",\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    }\n   },\n   \"required\": [\n    \"host\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"required\": [\n  \"spec\"\n ],\n \"title\": \"LDAP Identity Provider\",\n \"type\": \"object\"\n}"}