{"kind":"OIDCClient","apiVersion":"config.supervisor.pinniped.dev/v1alpha1","displayName":"OIDC Client","format":"JSON","metadata":{"genealogy":"","isNamespaced":true,"logoURL":"","model":"pinniped","modelDisplayName":"Pinniped","primaryColor":"#00B39F","published":false,"secondaryColor":"#00D3A9","shape":"circle","styleOverrides":"","subCategory":"Key Management","svgColor":"","svgComplete":"","svgWhite":""},"model":{"name":"pinniped","version":"1.0.8","displayName":"Pinniped","category":{"name":"Security \u0026 Compliance","metadata":null},"metadata":{"source_uri":"https://charts.bitnami.com/bitnami/pinniped-1.2.9.tgz"}},"schema":"{\n \"description\": \"OIDCClient describes the configuration of an OIDC client.\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"Spec of the OIDC client.\",\n   \"properties\": {\n    \"allowedGrantTypes\": {\n     \"description\": \"allowedGrantTypes is a list of the allowed grant_type param values that should be accepted during OIDC flows with this client. \\n Must only contain the following values: - authorization_code: allows the client to perform the authorization code grant flow, i.e. allows the webapp to authenticate users. This grant must always be listed. - refresh_token: allows the client to perform refresh grants for the user to extend the user's session. This grant must be listed if allowedScopes lists offline_access. - urn:ietf:params:oauth:grant-type:token-exchange: allows the client to perform RFC8693 token exchange, which is a step in the process to be able to get a cluster credential for the user. This grant must be listed if allowedScopes lists pinniped:request-audience.\",\n     \"items\": {\n      \"enum\": [\n       \"authorization_code\",\n       \"refresh_token\",\n       \"urn:ietf:params:oauth:grant-type:token-exchange\"\n      ],\n      \"type\": \"string\"\n     },\n     \"minItems\": 1,\n     \"type\": \"array\",\n     \"x-kubernetes-list-type\": \"set\"\n    },\n    \"allowedRedirectURIs\": {\n     \"description\": \"allowedRedirectURIs is a list of the allowed redirect_uri param values that should be accepted during OIDC flows with this client. Any other uris will be rejected. Must be a URI with the https scheme, unless the hostname is 127.0.0.1 or ::1 which may use the http scheme. Port numbers are not required for 127.0.0.1 or ::1 and are ignored when checking for a matching redirect_uri.\",\n     \"items\": {\n      \"pattern\": \"^https://.+|^http://(127\\\\.0\\\\.0\\\\.1|\\\\[::1\\\\])(:\\\\d+)?/\",\n      \"type\": \"string\"\n     },\n     \"minItems\": 1,\n     \"type\": \"array\",\n     \"x-kubernetes-list-type\": \"set\"\n    },\n    \"allowedScopes\": {\n     \"description\": \"allowedScopes is a list of the allowed scopes param values that should be accepted during OIDC flows with this client. \\n Must only contain the following values: - openid: The client is allowed to request ID tokens. ID tokens only include the required claims by default (iss, sub, aud, exp, iat). This scope must always be listed. - offline_access: The client is allowed to request an initial refresh token during the authorization code grant flow. This scope must be listed if allowedGrantTypes lists refresh_token. - pinniped:request-audience: The client is allowed to request a new audience value during a RFC8693 token exchange, which is a step in the process to be able to get a cluster credential for the user. openid, username and groups scopes must be listed when this scope is present. This scope must be listed if allowedGrantTypes lists urn:ietf:params:oauth:grant-type:token-exchange. - username: The client is allowed to request that ID tokens contain the user's username. Without the username scope being requested and allowed, the ID token will not contain the user's username. - groups: The client is allowed to request that ID tokens contain the user's group membership, if their group membership is discoverable by the Supervisor. Without the groups scope being requested and allowed, the ID token will not contain groups.\",\n     \"items\": {\n      \"enum\": [\n       \"openid\",\n       \"offline_access\",\n       \"username\",\n       \"groups\",\n       \"pinniped:request-audience\"\n      ],\n      \"type\": \"string\"\n     },\n     \"minItems\": 1,\n     \"type\": \"array\",\n     \"x-kubernetes-list-type\": \"set\"\n    }\n   },\n   \"required\": [\n    \"allowedGrantTypes\",\n    \"allowedRedirectURIs\",\n    \"allowedScopes\"\n   ],\n   \"type\": \"object\"\n  }\n },\n \"required\": [\n  \"spec\"\n ],\n \"title\": \"OIDC Client\",\n \"type\": \"object\"\n}"}