{
  "id": "00000000-0000-0000-0000-000000000000",
  "kind": "FileSystem",
  "apiVersion": "efs.services.k8s.aws/v1alpha1",
  "displayName": "File System",
  "format": "JSON",
  "hostID": "00000000-0000-0000-0000-000000000000",
  "metadata": {
   "capabilities": "",
   "defaultData": "",
   "genealogy": "",
   "isAnnotation": false,
   "isNamespaced": true,
   "primaryColor": "",
   "published": false,
   "secondaryColor": "",
   "shape": "",
   "shapePolygonPoints": "",
   "styleOverrides": "",
   "styles": "",
   "subCategory": "",
   "svgColor": "",
   "svgComplete": "",
   "svgWhite": ""
  },
  "model": {
   "id": "00000000-0000-0000-0000-000000000000",
   "name": "aws-efs-controller",
   "version": "v0.0.5",
   "displayName": "AWS Elastic File System",
   "status": "",
   "hostID": "00000000-0000-0000-0000-000000000000",
   "category": {
    "name": "Cloud Native Storage",
    "metadata": null
   },
   "metadata": {
    "isAnnotation": false,
    "published": false,
    "subCategory": "Cloud Native Storage",
    "svgColor": "",
    "svgComplete": "",
    "svgWhite": ""
   },
   "components": null,
   "relationships": null
  },
  "schema": "{\n \"description\": \"FileSystem is the Schema for the FileSystems API\",\n \"properties\": {\n  \"spec\": {\n   \"description\": \"FileSystemSpec defines the desired state of FileSystem.\",\n   \"properties\": {\n    \"availabilityZoneName\": {\n     \"description\": \"Used to create a One Zone file system. It specifies the Amazon Web Services\\nAvailability Zone in which to create the file system. Use the format us-east-1a\\nto specify the Availability Zone. For more information about One Zone file\\nsystems, see Using EFS storage classes (https://docs.aws.amazon.com/efs/latest/ug/storage-classes.html)\\nin the Amazon EFS User Guide.\\n\\n\\nOne Zone file systems are not available in all Availability Zones in Amazon\\nWeb Services Regions where Amazon EFS is available.\",\n     \"type\": \"string\"\n    },\n    \"backup\": {\n     \"description\": \"Specifies whether automatic backups are enabled on the file system that you\\nare creating. Set the value to true to enable automatic backups. If you are\\ncreating a One Zone file system, automatic backups are enabled by default.\\nFor more information, see Automatic backups (https://docs.aws.amazon.com/efs/latest/ug/awsbackup.html#automatic-backups)\\nin the Amazon EFS User Guide.\\n\\n\\nDefault is false. However, if you specify an AvailabilityZoneName, the default\\nis true.\\n\\n\\nBackup is not available in all Amazon Web Services Regions where Amazon EFS\\nis available.\",\n     \"type\": \"boolean\"\n    },\n    \"backupPolicy\": {\n     \"description\": \"The backup policy included in the PutBackupPolicy request.\",\n     \"properties\": {\n      \"status\": {\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"encrypted\": {\n     \"description\": \"A Boolean value that, if true, creates an encrypted file system. When creating\\nan encrypted file system, you have the option of specifying an existing Key\\nManagement Service key (KMS key). If you don't specify a KMS key, then the\\ndefault KMS key for Amazon EFS, /aws/elasticfilesystem, is used to protect\\nthe encrypted file system.\",\n     \"type\": \"boolean\"\n    },\n    \"fileSystemProtection\": {\n     \"properties\": {\n      \"replicationOverwriteProtection\": {\n       \"type\": \"string\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"kmsKeyID\": {\n     \"description\": \"The ID of the KMS key that you want to use to protect the encrypted file\\nsystem. This parameter is required only if you want to use a non-default\\nKMS key. If this parameter is not specified, the default KMS key for Amazon\\nEFS is used. You can specify a KMS key ID using the following formats:\\n\\n\\n  - Key ID - A unique identifier of the key, for example 1234abcd-12ab-34cd-56ef-1234567890ab.\\n\\n\\n  - ARN - An Amazon Resource Name (ARN) for the key, for example arn:aws:kms:us-west-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab.\\n\\n\\n  - Key alias - A previously created display name for a key, for example\\n    alias/projectKey1.\\n\\n\\n  - Key alias ARN - An ARN for a key alias, for example arn:aws:kms:us-west-2:444455556666:alias/projectKey1.\\n\\n\\nIf you use KmsKeyId, you must set the CreateFileSystemRequest$Encrypted parameter\\nto true.\\n\\n\\nEFS accepts only symmetric KMS keys. You cannot use asymmetric KMS keys with\\nAmazon EFS file systems.\",\n     \"type\": \"string\"\n    },\n    \"kmsKeyRef\": {\n     \"description\": \"AWSResourceReferenceWrapper provides a wrapper around *AWSResourceReference\\ntype to provide more user friendly syntax for references using 'from' field\\nEx:\\nAPIIDRef:\\n\\n\\n\\tfrom:\\n\\t  name: my-api\",\n     \"properties\": {\n      \"from\": {\n       \"description\": \"AWSResourceReference provides all the values necessary to reference another\\nk8s resource for finding the identifier(Id/ARN/Name)\",\n       \"properties\": {\n        \"name\": {\n         \"type\": \"string\"\n        }\n       },\n       \"type\": \"object\"\n      }\n     },\n     \"type\": \"object\"\n    },\n    \"lifecyclePolicies\": {\n     \"description\": \"An array of LifecyclePolicy objects that define the file system's LifecycleConfiguration\\nobject. A LifecycleConfiguration object informs EFS Lifecycle management\\nof the following:\\n\\n\\n  - TransitionToIA – When to move files in the file system from primary\\n    storage (Standard storage class) into the Infrequent Access (IA) storage.\\n\\n\\n  - TransitionToArchive – When to move files in the file system from their\\n    current storage class (either IA or Standard storage) into the Archive\\n    storage. File systems cannot transition into Archive storage before transitioning\\n    into IA storage. Therefore, TransitionToArchive must either not be set\\n    or must be later than TransitionToIA. The Archive storage class is available\\n    only for file systems that use the Elastic Throughput mode and the General\\n    Purpose Performance mode.\\n\\n\\n  - TransitionToPrimaryStorageClass – Whether to move files in the file\\n    system back to primary storage (Standard storage class) after they are\\n    accessed in IA or Archive storage.\\n\\n\\nWhen using the put-lifecycle-configuration CLI command or the PutLifecycleConfiguration\\nAPI action, Amazon EFS requires that each LifecyclePolicy object have only\\na single transition. This means that in a request body, LifecyclePolicies\\nmust be structured as an array of LifecyclePolicy objects, one object for\\neach storage transition. See the example requests in the following section\\nfor more information.\",\n     \"items\": {\n      \"description\": \"Describes a policy used by Lifecycle management that specifies when to transition\\nfiles into and out of storage classes. For more information, see Managing\\nfile system storage (https://docs.aws.amazon.com/efs/latest/ug/lifecycle-management-efs.html).\\n\\n\\nWhen using the put-lifecycle-configuration CLI command or the PutLifecycleConfiguration\\nAPI action, Amazon EFS requires that each LifecyclePolicy object have only\\na single transition. This means that in a request body, LifecyclePolicies\\nmust be structured as an array of LifecyclePolicy objects, one object for\\neach transition. For more information, see the request examples in PutLifecycleConfiguration.\",\n      \"properties\": {\n       \"transitionToArchive\": {\n        \"type\": \"string\"\n       },\n       \"transitionToIA\": {\n        \"type\": \"string\"\n       },\n       \"transitionToPrimaryStorageClass\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    },\n    \"performanceMode\": {\n     \"description\": \"The Performance mode of the file system. We recommend generalPurpose performance\\nmode for all file systems. File systems using the maxIO performance mode\\ncan scale to higher levels of aggregate throughput and operations per second\\nwith a tradeoff of slightly higher latencies for most file operations. The\\nperformance mode can't be changed after the file system has been created.\\nThe maxIO mode is not supported on One Zone file systems.\\n\\n\\nDue to the higher per-operation latencies with Max I/O, we recommend using\\nGeneral Purpose performance mode for all file systems.\\n\\n\\nDefault is generalPurpose.\",\n     \"type\": \"string\"\n    },\n    \"policy\": {\n     \"description\": \"The FileSystemPolicy that you're creating. Accepts a JSON formatted policy\\ndefinition. EFS file system policies have a 20,000 character limit. To find\\nout more about the elements that make up a file system policy, see EFS Resource-based\\nPolicies (https://docs.aws.amazon.com/efs/latest/ug/access-control-overview.html#access-control-manage-access-intro-resource-policies).\",\n     \"type\": \"string\"\n    },\n    \"provisionedThroughputInMiBps\": {\n     \"description\": \"The throughput, measured in mebibytes per second (MiBps), that you want to\\nprovision for a file system that you're creating. Required if ThroughputMode\\nis set to provisioned. Valid values are 1-3414 MiBps, with the upper limit\\ndepending on Region. To increase this limit, contact Amazon Web Services\\nSupport. For more information, see Amazon EFS quotas that you can increase\\n(https://docs.aws.amazon.com/efs/latest/ug/limits.html#soft-limits) in the\\nAmazon EFS User Guide.\",\n     \"type\": \"number\"\n    },\n    \"tags\": {\n     \"description\": \"Use to create one or more tags associated with the file system. Each tag\\nis a user-defined key-value pair. Name your file system on creation by including\\na \\\"Key\\\":\\\"Name\\\",\\\"Value\\\":\\\"{value}\\\" key-value pair. Each key must be unique.\\nFor more information, see Tagging Amazon Web Services resources (https://docs.aws.amazon.com/general/latest/gr/aws_tagging.html)\\nin the Amazon Web Services General Reference Guide.\",\n     \"items\": {\n      \"description\": \"A tag is a key-value pair. Allowed characters are letters, white space, and\\nnumbers that can be represented in UTF-8, and the following characters:+\\n- = . _ : /.\",\n      \"properties\": {\n       \"key\": {\n        \"type\": \"string\"\n       },\n       \"value\": {\n        \"type\": \"string\"\n       }\n      },\n      \"type\": \"object\"\n     },\n     \"type\": \"array\"\n    },\n    \"throughputMode\": {\n     \"description\": \"Specifies the throughput mode for the file system. The mode can be bursting,\\nprovisioned, or elastic. If you set ThroughputMode to provisioned, you must\\nalso set a value for ProvisionedThroughputInMibps. After you create the file\\nsystem, you can decrease your file system's Provisioned throughput or change\\nbetween the throughput modes, with certain time restrictions. For more information,\\nsee Specifying throughput with provisioned mode (https://docs.aws.amazon.com/efs/latest/ug/performance.html#provisioned-throughput)\\nin the Amazon EFS User Guide.\\n\\n\\nDefault is bursting.\",\n     \"type\": \"string\"\n    }\n   },\n   \"type\": \"object\"\n  }\n },\n \"title\": \"File System\",\n \"type\": \"object\"\n}"
 }