{"kind":"Route","apiVersion":"serving.knative.dev/v1","displayName":"Route","format":"JSON","metadata":{"genealogy":"","isNamespaced":true,"logoURL":"","model":"knative-serving","modelDisplayName":"knative-serving","primaryColor":"#0865ad","published":false,"secondaryColor":"#4DAAF2","shape":"circle","styleOverrides":"","subCategory":"Uncategorized","svgColor":"","svgComplete":"","svgWhite":""},"model":{"name":"knative-serving","version":"1.0.1","displayName":"knative-serving","category":{"name":"Uncategorized","metadata":null},"metadata":null},"schema":"{\n \"description\": \"Spec holds the desired state of the Route (from the client).\",\n \"properties\": {\n  \"traffic\": {\n   \"description\": \"Traffic specifies how to distribute traffic over a collection of revisions and configurations.\",\n   \"items\": {\n    \"description\": \"TrafficTarget holds a single entry of the routing table for a Route.\",\n    \"properties\": {\n     \"configurationName\": {\n      \"description\": \"ConfigurationName of a configuration to whose latest revision we will send this portion of traffic. When the \\\"status.latestReadyRevisionName\\\" of the referenced configuration changes, we will automatically migrate traffic from the prior \\\"latest ready\\\" revision to the new one.  This field is never set in Route's status, only its spec.  This is mutually exclusive with RevisionName.\",\n      \"type\": \"string\"\n     },\n     \"latestRevision\": {\n      \"description\": \"LatestRevision may be optionally provided to indicate that the latest ready Revision of the Configuration should be used for this traffic target.  When provided LatestRevision must be true if RevisionName is empty; it must be false when RevisionName is non-empty.\",\n      \"type\": \"boolean\"\n     },\n     \"percent\": {\n      \"description\": \"Percent indicates that percentage based routing should be used and the value indicates the percent of traffic that is be routed to this Revision or Configuration. `0` (zero) mean no traffic, `100` means all traffic. When percentage based routing is being used the follow rules apply: - the sum of all percent values must equal 100 - when not specified, the implied value for `percent` is zero for that particular Revision or Configuration\",\n      \"format\": \"int64\",\n      \"type\": \"integer\"\n     },\n     \"revisionName\": {\n      \"description\": \"RevisionName of a specific revision to which to send this portion of traffic.  This is mutually exclusive with ConfigurationName.\",\n      \"type\": \"string\"\n     },\n     \"tag\": {\n      \"description\": \"Tag is optionally used to expose a dedicated url for referencing this target exclusively.\",\n      \"type\": \"string\"\n     },\n     \"url\": {\n      \"description\": \"URL displays the URL for accessing named traffic targets. URL is displayed in status, and is disallowed on spec. URL must contain a scheme (e.g. http://) and a hostname, but may not contain anything else (e.g. basic auth, url path, etc.)\",\n      \"type\": \"string\"\n     }\n    },\n    \"type\": \"object\"\n   },\n   \"type\": \"array\"\n  }\n },\n \"title\": \"Route\",\n \"type\": \"object\"\n}"}